//? *s..
//? |i..
//? |s..
//
//u.. s..
//
//// Перегруженные функции могут отличаться типом и количеством аргументов
//v.. ?
//v.. ? s.. s
//v.. ? in. i
//v.. ? d.. d
//v.. ? s.. s, in. i
//v.. ? in. i, s.. s
//
//// void Function(string); // Так делать нельзя
//
//in. main
//
//	?                  // 1-я перегрузка.
//	? "A"             // 2-я перегрузка.
//	? 1                 // 3-я перегрузка.
//	? 3.14           // 4-я перегрузка.
//	? "B ", 2          // 5-я перегрузка.
//	? 3, " C"          // 6-я перегрузка.
//
//	sy.. pause
//    r_ 0
//
//
//v.. Function
//
//	c__ __  "Hello" __  e..
//
//
//v.. Function s.. s
//
//	c__ __  ? __  e..
//
//
//v.. Function in. i
//
//	c__ __  ? __  e..
//
//
//v.. Function d.. d
//
//	c__ __  ? __  e..
//
//
//v.. Function s.. s, in. i
//
//	c__ __  "s = " __  ? __  ", i = " __  ? __  e..
//
//
//v.. Function(in. i, s.. s)
//
//	c__ __  "i = " __  ? __  ", s = " __  ? __  e..
