//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//
//	c__.s_f(i.. bo..a..					// ¬ключить вывод логических величин в текстовом виде
//
//	bo.. a _ t..
//	bo.. b _ f..
//
//	c__ __  "a = " __  a __  "; b = " __  b __  e..
//
//	c__.uns_f i.. bo..alpha /* noboolalpha */	// ќтключить вывод логических величин в текстовом виде
//
//
//	c__.uns_f i.. dec
//	c__.s_f i.. s_b.. /* noshowbase */ | i.. s_p.. /* noshowpos */
//
//	in. number _ 16
//
//	c__ __  "number = " __  ? __  e..
//
//    r_ 0;
//}
//
