//? *s..
//? |i..
//
//u.. s..
///*
//	ћанипул¤тор Ц объект особого типа, который управл¤ет потоками ввода\вывода,
//	дл¤ форматировани¤ передаваемой в поток информации.
//*/
//in. main
//
//	c__ __  e..								// ѕереход на новую строку при выводе
//
//	c__ __  bo..a.. __  t.. __  e..			// ¬ывод логических величин в текстовом виде
//
//	c__ __  nobo..a.. __  f.. __  e..		// ¬ывод логических	величин в числовом виде
//
//	c__ __  oc. __  16 __  e..					// ¬ывод величин в восьмеричной	системе счислени¤
//
//	c__ __  de. __  10 __  e..					// ¬ывод величин в дес¤тичной системе счислени¤(по умолчанию)
//
//	c__ __  he. __  255 __  e..					// ¬ывод величин в шестнадцатеричной системе счислени¤
//
//	c__ __  sh.. __  10 __  e..				// ¬ыводить индикатор основани¤ системы счислени¤
//
//	c__ __  no.. __  10 __  e..			// Ќе выводить индикатор основани¤ системы счислени¤(по умолчанию).
//
//	c__ __  up.. __  255 __  e..			// шестнадцатеричной системе счислени¤ использовать буквы верхнего регистра
//
//	c__ __  no.. __  255 __  e..			// шестнадцатеричной системе счислени¤ использовать буквы нижнего регистра
//
//	c__ __  de. __  sh.. __  1 __  e..				// ¬ывод знака плюс + дл¤ положительных чисел
//
//	c__ __  no.. __  1 __  e..				// Ќе выводить знак плюс + дл¤ положительных чисел (по умолчанию).
//
//	c__ __  sc.. __  1.234561944 __  e..	// ¬ывод чисел с плавающей точкой в экспоненциальной форме
//
//	c__ __  fi.. __  1.234567 __  e..			// ¬ывод чисел с плавающей точкой в фиксированной форме
//
//	c__.w.. 40
//	c__ __  ri.. __  "Test string!" __  e..	// ¬ыравнивание по правой границе(по умолчанию).
//
//	c__.w.. 40
//	c__.f.. '*'
//	c__ __  le.. __  "Test string!" __  e..		// ¬ыравнивание по левой границе.
//
//    r_ _
//
//
