//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//	sh.. a _ 1 b _ 2
//	bo.. result
//
//	c__.s_f i.. bo..a..
//	// > - больше
//	? _ a > b
//	c__ __  a > b _  __  ? __  e..
//	// >_ - больше или равно
//	? _ a >_ b
//	c__ __  "a >_ b _ " __  ? __  e..
//	// < - меньше
//	? _ a < b
//	c__ __  "a < b _ " __  ? __  e..
//	// <_ - меньше или равно
//	? _ a <_ b
//	c__ __  "a <_ b _ " __  ? __  e..
//	// __ - оператор равенства
//	? _ a __ b
//	c__ __  "a __ b _ " __  ? __  e..
//	// !_ - оператор неравенства
//	? _ a !_ b
//	c__ __  "a !_ b _ " __  ? __  e..
//	// Zадержка
//	c__.g..
//    r_ _
//}
//
