? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 и на 3 элемента.
	in. arr[3][3][3];


	// Заполняем массив.
	arr[0][0][0] = 1;
	arr[0][0][1] = 2;
	arr[0][0][2] = 3;
	arr[0][1][0] = 4;
	arr[0][1][1] = 5;
	arr[0][1][2] = 6;
	arr[0][2][0] = 7;
	arr[0][2][1] = 8;
	arr[0][2][2] = 9;

	arr[1][0][0] = 1;
	arr[1][0][1] = 2;
	arr[1][0][2] = 3;
	arr[1][1][0] = 4;
	arr[1][1][1] = 5;
	arr[1][1][2] = 6;
	arr[1][2][0] = 7;
	arr[1][2][1] = 8;
	arr[1][2][2] = 9;

	arr[2][0][0] = 1;
	arr[2][0][1] = 2;
	arr[2][0][2] = 3;
	arr[2][1][0] = 4;
	arr[2][1][1] = 5;
	arr[2][1][2] = 6;
	arr[2][2][0] = 7;
	arr[2][2][1] = 8;
	arr[2][2][2] = 9;



	// Выводим значения массива в консоль.
	for (in. i = 0; i < 3; i++)
	{
		for (in. j = 0; j < 3; j++)
		{
			for (in. k = 0; k < 3; k++)
			{
				c__ __  arr[i][j][k] __  " ";
			}
			c__ __  e..
		}
		c__ __  e..
	}

	system("pause");
	r_ 0;
}

