? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 и на 3 элемента.
	in. arr[3][3][3]


	// Заполняем массив.
	arr[0][0][0] _ 1sy.. p..
	arr[0][0][1] _ 2sy.. p..
	arr[0][0][2] _ 3sy.. p..
	arr[0][1][0] _ 4sy.. p..
	arr[0][1][1] _ 5sy.. p..
	arr[0][1][2] _ 6sy.. p..
	arr[0][2][0] _ 7sy.. p..
	arr[0][2][1] _ 8sy.. p..
	arr[0][2][2] _ 9sy.. p..

	arr[1][0][0] _ 1sy.. p..
	arr[1][0][1] _ 2sy.. p..
	arr[1][0][2] _ 3sy.. p..
	arr[1][1][0] _ 4sy.. p..
	arr[1][1][1] _ 5sy.. p..
	arr[1][1][2] _ 6sy.. p..
	arr[1][2][0] _ 7sy.. p..
	arr[1][2][1] _ 8sy.. p..
	arr[1][2][2] _ 9sy.. p..

	arr[2][0][0] _ 1sy.. p..
	arr[2][0][1] _ 2sy.. p..
	arr[2][0][2] _ 3sy.. p..
	arr[2][1][0] _ 4sy.. p..
	arr[2][1][1] _ 5sy.. p..
	arr[2][1][2] _ 6sy.. p..
	arr[2][2][0] _ 7sy.. p..
	arr[2][2][1] _ 8sy.. p..
	arr[2][2][2] _ 9sy.. p..



	// Выводим значения массива в консоль.
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		___ (in. j _ 0sy.. p.. j < 3sy.. p.. j++)
		{
			___ (in. k _ 0sy.. p.. k < 3sy.. p.. k++)
			{
				c__ __  arr[i][j][k] __  " "
			}
			c__ __  e..
		}
		c__ __  e..
	}


	r_ 0sy.. p..
}

