? *s..
? |i..

u.. s..
// C++ преобразует значения во время присваивания значения одного типа переменной, относящейся к другому типу;
// С++ преобразует значения при комбинировании разных типов в выражениях;
// С++ преобразует значения при передаче аргументов функциям.

in. main()
{
	float a _ 3;			// тип int преобразуется в float
	c__ __  a __  e..
	
	in. b _ 3.145f;			// тип float преобразуется в  int
	c__ __  b __  e..

	// int c = 7.2E12;			// значение не определенно
	// cout << c << endl;

	in. x _ 100;

	//char d1 = { 31325 };	// сужение не допускается
	// cout << d1;			// Ошибка

	char d2 _ { 66 };		//  Допустимо, поскольку значение 66 входит в допустимый диапазон значений типа char

	char d3 _ x;			// Этой формой инициализации допустим
//	char d4 { x };			// Не допустимо

	// Задержка
	c__.g..
    r_ 0;
}

