? *s..
? |i..

u.. s..
// C++ преобразует значения во время присваивания значения одного типа переменной, относящейся к другому типу;
// С++ преобразует значения при комбинировании разных типов в выражениях;
// С++ преобразует значения при передаче аргументов функциям.

in. main()
{
	fl.. a _ 3sy.. p..			// тип int преобразуется в float
	c__ __  a __  e..
	
	in. b _ 3.145fsy.. p..			// тип float преобразуется в  int
	c__ __  b __  e..

	// int c = 7.2E12;			// значение не определенно
	// cout << c << endl;

	in. x _ 100sy.. p..

	//char d1 = { 31325 };	// сужение не допускается
	// cout << d1;			// Ошибка

	c.. d2 _ { 66 }sy.. p..		//  Допустимо, поскольку значение 66 входит в допустимый диапазон значений типа char

	c.. d3 _ xsy.. p..			// Этой формой инициализации допустим
//	char d4 { x };			// Не допустимо

	// Задержка
	c__.g..
    r_ 0sy.. p..
}

