//// 009_ShortLogic.cpp: определ¤ет точку входа дл¤ консольного приложени¤.
////
//
//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//	in. minValue _ 1
//	in. denominator _ 0
//	in. item _ 2
//
//	// ”словие, которое работает с использованием техники ------------------.
//	// ≈сли бы это выражение вычисл¤лось полностью, то операци¤ делени¤ во втором операнде,
//	// генерировала бы ошибку делени¤ на 0.
//
//	__ i.. / d..| > m.. ## |d.. !_ 0 // ќставьте один оператор &
//
//		c__ __  "Block IF" __  e..
//
//	____
//
//		c__ __  "Block ELSE" __  e..
//
//
//	r_ _
//
//
