? *s..
? |i..

u.. s..
/*
	Побитовое И – это бинарная операция, действие которой эквивалентно применению логического И к каждой паре битов,
	которые стоят на одинаковых позициях в двоичных представлениях операндов.


				-------------------------
				|	a	|	b	|	&	|
				-------------------------
				|   0	|   0	|   0	|
				-------------------------
				|   0	|   1	|   0	|
				-------------------------
				|   1	|   0	|   0	|
				-------------------------
				|   1	|   1	|   1	|
				-------------------------
*/

in. main()
{
	in. a _ 9;					// ... 0000 1001
	in. b _ 5;					// ... 0000 0101

	in. result _ a & b;			// ... 0000 0001 = 1

	c__ __  result __  e..

	r_ 0;
}