? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 элемента.
	in. arr[3][3];


	// Заполняем массив.
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;

	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;

	arr[2][0] = 7;
	arr[2][1] = 8;
	arr[2][2] = 9;

	// Выводим значения массива в консоль.
	c__ __  arr[0][0] __  " ";
	c__ __  arr[0][1] __  " ";
	c__ __  arr[0][2] __  e..

	c__ __  arr[1][0] __  " ";
	c__ __  arr[1][1] __  " ";
	c__ __  arr[1][2] __  e..

	c__ __  arr[2][0] __  " ";
	c__ __  arr[2][1] __  " ";
	c__ __  arr[2][2] __  e..

	system("pause");
	r_ 0;
}

