? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 элемента.
	in. arr[3][3]sy.. p..


	// Заполняем массив.
	arr[0][0] _ 1sy.. p..
	arr[0][1] _ 2sy.. p..
	arr[0][2] _ 3sy.. p..

	arr[1][0] _ 4sy.. p..
	arr[1][1] _ 5sy.. p..
	arr[1][2] _ 6sy.. p..

	arr[2][0] _ 7sy.. p..
	arr[2][1] _ 8sy.. p..
	arr[2][2] _ 9sy.. p..

	// Выводим значения массива в консоль.
	c__ __  arr[0][0] __  " "sy.. p..
	c__ __  arr[0][1] __  " "sy.. p..
	c__ __  arr[0][2] __  e..

	c__ __  arr[1][0] __  " "sy.. p..
	c__ __  arr[1][1] __  " "sy.. p..
	c__ __  arr[1][2] __  e..

	c__ __  arr[2][0] __  " "sy.. p..
	c__ __  arr[2][1] __  " "sy.. p..
	c__ __  arr[2][2] __  e..

	sy.. p..
	r_ 0sy.. p..
}

