//? *s..
//? |i..
//
//u.. s..
///*
//	Конъюнкция – это логическая операция, ставящая в соответствие каждым двум простым высказываниям составное высказывание,
//	являющееся истинным только тогда, когда оба исходных высказывания истинны. Операция конъюнкции по своему применению
//	близка к союзу «И».
//
//					-------------------------
//					|	a	|	b	|	&&	|
//					-------------------------
//					| true	| true	| true	|
//					-------------------------
//					| true	| false	| false	|
//					-------------------------
//					| false	| true	| false	|
//					-------------------------
//					| false	| false	| false	|
//					-------------------------
//*/
//
//in. main
//
//	bo.. a _ t..		// 1
//	bo.. b _ t..		// 0
//
//	bo.. result _ a ## b
//
//	c__ __  bo..alpha __  result __  e..
//
//    r_ _
//
//
////#include "stdafx.h"
////#include <iostream>
////
////using namespace std;
////
////int main()
////{
////
////
////	return 0;
////}