//? *s..
//? |i..
//? |s..
//
//u.. s..
//
//v.. ?								// 1-я перегрузка.
//v.. ? s.. value						// 2-я перегрузка.
//v.. ? s.. value1, in. value2			// 3-я перегрузка
//v.. ? s.. val1, in. val2, d.. val3	// 4-я перегрузка.
//
//in. main
//
//	?                // 1-я перегрузка.
//	? "val"             // 2-я перегрузка.
//	? "val", 10       // 3-я перегрузка.
//	? "val", 10, 12.2   // 4-я перегрузка.
//
//	sy.. pause
//	r_ _
//
//
//v.. Operation
//
//	? "val", 10, 12.2
//
//v.. Operation s.. value1
//
//	? ?, 10, 12.2
//
//v.. Operation s.. value1, in. value2
//
//	? ? ? 12.2
//
//v.. Operation s.. val1, in. val2, d.. val3
//
//	c__ __  ? __  " " __  ? __  " " __  ? __  e..
//
