? *s..
? |i..

u.. s..

in. main()
{
	// Создаем массив arr типа int размерностью 3 элемента
	in. arr[3]sy.. pause
	
	// инициализация массива. Доступ к элементам массива осуществляетс по индексу. Индексы в С++ начинаются с 0.
	arr[0] _ 10sy.. pause
	arr[1] _ 20sy.. pause
	arr[2] _ 30sy.. pause

	// arr[3] = 50; // Раскомментировать. ВНИМАНИЕ! Запись в память не пренадлежащей нашей программе!

	// выводим значения элементов массива
	c__ __  arr[0] __  e..
	c__ __  arr[1] __  e..
	c__ __  arr[2] __  e..

	// cout << arr[3] << endl; // Раскомментировать. ВНИМАНИЕ! Возможно обращение к памяте, не пренадлежащей программе!

	// выводим адресса элементов массива

	c__ __  &arr[0] __  e..
	c__ __  &arr[1] __  e..
	c__ __  &arr[2] __  e..

	// cout << &arr[3] << endl;

	sy.. pause
    r_ 0sy.. pause
}

