//? *s..
//? |i..
//
//? |ct..
//
//u.. s..
//
//in. main
//
//	c__.w.. 80							// задает ширину поля
//	c__.f.. '*'							// устанавливает символ заполнитель, по умолчианию символ заполнитель - пробел
//
//	c__ __  left __  "Hello, Vladimir!" __  e..
//
//	// по умолчанию точность равна 6
//	c__ __  fi..		// манипулятор показывает, что установленная точность относится к количеству знаков после запятой
//	c__.pr.. 3  // задает количество знаков после десятичной точки
//
//	c__ __  3.31456473 __  e..
//
//    r_ _
//}
//
