? *s..
? |i..

? <ctime>

u.. s..

in. main()
{
	c__.width(80);							// задает ширину поля
	c__.fill('*');							// устанавливает символ заполнитель, по умолчианию символ заполнитель - пробел

	c__ __  left __  "Hello, Vladimir!" __  e..
		
	// по умолчанию точность равна 6
	c__ __  fixed;		// манипулятор показывает, что установленная точность относится к количеству знаков после запятой
	c__.precision(3);  // задает количество знаков после десятичной точки

	c__ __  3.31456473 __  e..

    r_ 0;
}

