? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 элемента.
	in. arr[3][3]sy.. p..

	// Заполняем элементы массива значениями
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		___ (in. j _ 0sy.. p.. j < 3sy.. p.. j++)
		{
			arr[i][j] _ i * j + 2sy.. p..
		}
	}

	// Выводим значения элементов массива в консоль
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		___ (in. j _ 0sy.. p.. j < 3sy.. p.. j++)
		{
			c__ __  arr[i][j] __  " "sy.. p..
		}
		c__ __  e..
	}

	sy.. p..
	r_ 0sy.. p..
}

