? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 и на 3 элемента.
	in. arr[3][3][3] _	{
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							},
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							},
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							}
						}sy.. p..

	// Выводим значения элементов массива в консоль
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		___ (in. j _ 0sy.. p.. j < 3sy.. p.. j++)
		{
			___ (in. k _ 0sy.. p.. k < 3sy.. p.. k++)
			{
				c__ __  arr[i][j][k] __  " "sy.. p..
			}
			c__ __  e..
		}
		c__ __  e..
	}

	sy.. p..
	r_ 0sy.. p..
}