? *s..
? |i..

u.. s..

in. main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 и на 3 элемента.
	in. arr[3][3][3] _	{
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							},
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							},
							{
								{ 1, 2, 3 },
								{ 4, 5, 6 },
								{ 7, 8, 9 }
							}
						};

	// Выводим значения элементов массива в консоль
	___ (in. i _ 0; i < 3; i++)
	{
		___ (in. j _ 0; j < 3; j++)
		{
			___ (in. k _ 0; k < 3; k++)
			{
				c__ __  arr[i][j][k] __  " ";
			}
			c__ __  e..
		}
		c__ __  e..
	}

	system("pause");
	r_ 0;
}