//? *s..
//? |i..
//
//u.. s..
//
//// Константный указатель на константные данные,т.е. ничто не может быть изменено
//v.. CalcArea c.. d..& c.. _Pi, c.. d..& c.. _Radius, d..& c.. _Area)
//
//	// проверить указатели перед использованием!
//	__ ? ## ? ## ?
//		&_A.. _ &_P.. * &_R.. * &_R..
//
//
//in. main
//
//	c.. d.. pi _ 3.1416
//	c__ __  "Enter radius of circle: "
//
//	d.. radius _ 0
//	c__ __ ?
//
//	d.. area _ 0
//
//	? ? ? ?
//
//	c__ __  "Area is = " __  a.. __  e..
//
//	sy.. pause
//	r_ _
