//? *s..
//? |i..
//
//u.. s..
///*
//		Побитовое ИЛИ – это бинарная операция, действие которой эквивалентно применению логического ИЛИ к каждой паре битов,
//		которые стоят на одинаковых позициях в двоичных представлениях операндов.
//
//						-------------------------
//						|	a	|	b	|	&	|
//						-------------------------
//						|   0	|   0	|   0	|
//						-------------------------
//						|   0	|   1	|   1	|
//						-------------------------
//						|   1	|   0	|   1	|
//						-------------------------
//						|   1	|   1	|   1	|
//						-------------------------
//*/
//
//in. main
//
//	in. a _ 9				// ... 0000 1001
//	in. b _ 5				// ... 0000 0101
//
//	in. result _ a # b		// ... 0000 1101 = 13
//
//	c__ __  ? __  e..
//
//	r_ _
