? *s..
? |i..

u.. s..
/*
		Побитовое ИЛИ – это бинарная операция, действие которой эквивалентно применению логического ИЛИ к каждой паре битов, 
		которые стоят на одинаковых позициях в двоичных представлениях операндов.

						-------------------------
						|	a	|	b	|	&	|
						-------------------------
						|   0	|   0	|   0	|
						-------------------------
						|   0	|   1	|   1	|
						-------------------------
						|   1	|   0	|   1	|
						-------------------------
						|   1	|   1	|   1	|
						-------------------------
*/

in. main()
{
	in. a = 9;					// ... 0000 1001
	in. b = 5;					// ... 0000 0101

	in. result = a | b;			// ... 0000 1101 = 13

	c__ __  result __  e..

	r_ 0;
}