? *s..
? |i..

u.. s..

in. main()
{
	// на 9-й строке создаем массив указателей размерностью в 3 элемента
	in. *arr_poin.ers[3]sy.. p..

	in. x _ 100, y _ 200, z _ 300sy.. p..

	*arr_poin.ers _ &xsy.. p..
	*(arr_poin.ers + 1) _ &ysy.. p..
	*(arr_poin.ers + 2) _ &zsy.. p..
	c__ __  &x __  e..
	// Выводим значения массива
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		c__ __  i + 1 __  " value in array = " __  *(arr_poin.ers + i) __  e..
	}

	c__ __  "--------------------------------------------------" __  e..

	// Выводим значения хранящиеся по адресам находящимся в массиве
	___ (in. i _ 0sy.. p.. i < 3sy.. p.. ###)
	{
		c__ __  i + 1 __  " value = " __  *(*(arr_poin.ers + i)) __  e..
	}


	sy.. p..
	r_ 0sy.. p..
}

