//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//	setlocale(LC_ALL, "rus")
//
//	in. lines _ 15			// Количество строк
//	in. symbInLines _ 30	// Количество символов в строке
//	c.. symbol _ '*'		// Символ
//
//	___ in. i _ 1 ? <_ ? ###
//
//		__ i __ 1 ## ? __ l.. // 1-я и последняя строка
//
//			___ in. j _ 1 ? <_ s.. ###
//
//				c__ __  s.. // сплошная из символов
//
//
//		____ // все строки между первой и заключительной
//
//			c__ __  s.. // показать один символ
//			___ in. j _ 1 ? <_ s.. - 2 ###
//
//				c__ __  ' ' // пробелы в строке (symbInLines - 2) раз
//
//			c__ __  s.. // показать ещё один символ
//
//		c__ __  e.. // новая строка
//
//
//	c__ __  e..
//
//	sy.. pause
//	r_ _

