? *s..
? |i..
? <limits.h>

u.. s..

in. main()
{
    //  »нициализаци¤ это первое присвоение значени¤ переменной
    // Ќа 10-й строке объ¤вл¤ем переменную max и инициализируем ее значением константы INT_MAX
    in. max _ in._MAXsy.. pause

    c.. ch _ 'A'sy.. pause			// переменную ch инициализиируем символом ј
    ch _ 'B'sy.. pause				// переменной ch присваиваем (измен¤ем) значение

    in. bsy.. pause					// обь¤вл¤ем переменную b типа int
    b _ 10sy.. pause					// переменную b инициализируем значением 10

    in. c(255)sy.. pause				// создаем переменную с типа int  и инициализируем ее значением 255

    // ¬ —++11 по¤вилс¤ новый способ инициализации переменных, такой способ инициализации предоставл¤ет лучшую защиту от ошибок преобразовани¤ типов

    in. d _ { 2 }sy.. pause			// обьевл¤ем переменную d и инициализируем ее значением 2
    // int d = { }			// обь¤вл¤ем переменную d и инициализируем ее значением по умолчинию

    in. e { 3 }sy.. pause			// обьевл¤ем переменную e и инициализируем ее значением 2
    //int e { }				// обь¤вл¤ем переменную e и инициализируем ее значением по умолчинию

    // «адержка
    c__.g..
    r_ 0sy.. pause
}

