//? *s..
//? |i..
//
//u.. s..
///*
//		»сключающее »Ћ» Ц это логическа¤ операци¤, став¤ща¤ в соответствие каждым двум простым высказывани¤м составное
//		высказывание, ¤вл¤ющеес¤ истинными тогда, когда оба операнда различаютс¤.
//
//
//					-------------------------
//					|	a	|	b	| ----	|
//					-------------------------
//					| true	| true	| false	|
//					-------------------------
//					| true	| false	| true	|
//					-------------------------
//					| false	| true	| true	|
//					-------------------------
//					| false	| false	| false	|
//					-------------------------
//*/
//
//in. main
//
//	bo.. a _ t..		// 1
//	bo.. b _ f..		// 0
//
//	bo.. result _ (a ## b) ## ##(a ## b)	// 1 - true
//
//	c__ __  bo..a.. __  ? __  e..
//
//	r_ _
