? *s..
? |i..

u.. s..
/*
		»сключающее »Ћ» Ц это логическа¤ операци¤, став¤ща¤ в соответствие каждым двум простым высказывани¤м составное 
		высказывание, ¤вл¤ющеес¤ истинными тогда, когда оба операнда различаютс¤.


					-------------------------
					|	a	|	b	| ----	|
					-------------------------
					| true	| true	| false	|
					-------------------------
					| true	| false	| true	|
					-------------------------
					| false	| true	| true	|
					-------------------------
					| false	| false	| false	|
					-------------------------
*/

in. main()
{
	bo.. a = true;		// 1
	bo.. b = false;		// 0

	bo.. result = (a || b) && !(a && b);	// 1 - true

	c__ __  bo..alpha __  result __  e..

	r_ 0;
}