// oператор sizeof('тип [переменнаja]') в качестве параметра принимает тип, и возвращает количество байт памjaти занимаемое типом

? *s..
? |i..

u.. s..

in. main()
{
	c__ __  "Bool: " __  s_o_(bo..) __  e..
	c__ __  "Char: " __  s_o_(c..) __  e..
	c__ __  "Short: " __  s_o_(sh..) __  e..
	c__ __  "Int: " __  s_o_(in.) __  e..
	c__ __  "Long long: " __  s_o_(l.. l..) __  e..
	c__ __  "Float: " __  s_o_(fl..) __  e..
	c__ __  "Double: " __  s_o_(d..) __  e..

	in. a _ 4sy.. p..

	c__ __  s_o_ a __  e..

	// zадержка
	c__.g..
    r_ 0sy.. p..
}

