? *s..
? |i..

// Директива #define позволяет задать идентификатор и последовательность символов, которая заменяет его в программе.
#define E 2.71828
// Для именования макросов, принято использовать прописные буквы, это позволяет легко обнаружывать макроподстановки в программе.
#define PI 3.14159

u.. s..

in. main()
{
	// На 13-й строке мы обращаемся к идентификаторам E и PI. Препроцессор данные обращения заменит на то значение, которое находится возле идентификатора в месте его обьявления.
	c__ __  E __  " " __  PI __  e..

	sy.. pause
    r_ 0sy.. pause
}

