? *s..
? |i..

u.. s..

in. main()
{
	// Создаем массив arr типа int размерностью в 4 элемента, и в блоке инициализатора, инициализируем элементы массива, соответствующими значениями
	in. arr[4] _ { 10, 20, 30, 40 };	// arr[0] = 10;	arr[1] = 20; arr[2] = 30; arr[3] = 40;

	// arr[4] = 50; // Раскомментировать. ВНИМАНИЕ! Запись в память не пренадлежащей нашей программе!

	// выводим значения элементов массива
	c__ __  arr[0] __  e..
	c__ __  arr[1] __  e..
	c__ __  arr[2] __  e..
	c__ __  arr[3] __  e..

	// cout << arr[4] << endl; // Раскомментировать. ВНИМАНИЕ! Возможно обращение к памяте, не пренадлежащей программе!

	// выводим адресса элементов массива

	c__ __  &arr[0] __  e..
	c__ __  &arr[1] __  e..
	c__ __  &arr[2] __  e..
	c__ __  &arr[3] __  e..

	// cout << &arr[4] << endl;

	system("pause");
	r_ 0;
}

