#include "stdafx.h"
#include <iostream>

using namespace std;
/*
		ƒизъюнкци¤ Ц это логическа¤ операци¤, став¤ща¤ в соответствие каждым двум простым высказывани¤м составное 
		высказывание, ¤вл¤ющеес¤ ложным только тогда, когда оба исходных высказывани¤ ложны. 
		ќпераци¤ дизъюнкции по своему применению близка к союзу Ђ»Ћ»ї.

					-------------------------
					|	a	|	b	|	||	|
					-------------------------
					| true	| true	| true	|
					-------------------------
					| true	| false	| true	|
					-------------------------
					| false	| true	| true	|
					-------------------------
					| false	| false	| false	|
					-------------------------
*/

int main()
{
	bool a = true;		// 1
	bool b = false;		// 0

	bool result = a || b;

	cout << boolalpha << result << endl;

	return 0;
}