//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//	c.. ch _ 'A'
//
//	bo.. result _ isa.. ?				// функция проверяет, является ли параметр буквой
//
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ '\r'
//	result _ isc.. ?					// функция проверяет, является ли символ управляющей последовательностью
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ '1'
//	result _ isdigit ?					// функция проверяет, является ли символ числом
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ 'q'
//	result _ islower ?					//  функция проверяет, находится ли символ в нижнем регистре
//	c__ __  bo..a.. __  ? __  e..
//
//	result _ isupper ?					// функция проверяет, находится ли символ в верхнем регистре
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ ','
//	result _ ispunct ?					// функция проверяет, является ли символ, символом пунктуации
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ '\t'
//	result _ isspace ?					//функция проверяет, является ли символ пробельным
//	c__ __  bo..a.. __  ? __  e..
//
//	ch _ tolower('A')						// функция преобразовывает символ в верхнем регистре в символ в нижнем регистре
//	c__ __  ch __  e..
//
//	ch _ toupper ?						// функция преобразовывает символ в нижнем регистре  в символ в верхнем регистре
//	c__ __  ch __  e..
//
//	r_ 0
//
//
