//? *s..
//? |i..
//// Ссылки представляют собой "псевдонимы" для переменных и позволяют работать с данными через ссылку не по копии а по значению.
//u.. s..
//
//in. main
//
//	in. a _ 10 sy.. pause
//
////	c__ __  "Variable a = " __   __  e..
//
//	// Создаем ссылку на переменную типа int
//	in. #b _ a sy.. pause
//
//	c__ __  "Variable a = " __  ? __  e..
//	c__ __  "Change variable b" __  e..
//
//	b _ 15 sy.. pause
//
//	c__ __  "Variable a = " __  ? __  e..
//	c__ __  "Variable a = " __  ? __  e..
//
//	// int &c; // Не допустимо! При объявлении ссылочную переменную необходимо инициализировать.
//
//	sy.. pause
//	r_ _ sy.. pause
//
//
