? *s..
? |i..
// Ссылки представляют собой "псевдонимы" для переменных и позволяют работать с данными через ссылку не по копии а по значению.
u.. s..

in. main()
{
	in. a _ 10sy.. pause

	c__ __  "Variable a = " __  a __  e..

	// Создаем ссылку на переменную типа int
	in. &b _ asy.. pause

	c__ __  "Variable a = " __  b __  e..
	c__ __  "Change variable b" __  e..

	b _ 15sy.. pause

	c__ __  "Variable a = " __  a __  e..
	c__ __  "Variable a = " __  b __  e..

	// int &c; // Не допустимо! При объявлении ссылочную переменную необходимо инициализировать.

	sy.. pause
	r_ 0sy.. pause
}

