? *s..
? |i..

u.. s..
/*
		ƒизъюнкци¤ Ц это логическа¤ операци¤, став¤ща¤ в соответствие каждым двум простым высказывани¤м составное 
		высказывание, ¤вл¤ющеес¤ ложным только тогда, когда оба исходных высказывани¤ ложны. 
		ќпераци¤ дизъюнкции по своему применению близка к союзу Ђ»Ћ»ї.

					-------------------------
					|	a	|	b	|	||	|
					-------------------------
					| true	| true	| true	|
					-------------------------
					| true	| false	| true	|
					-------------------------
					| false	| true	| true	|
					-------------------------
					| false	| false	| false	|
					-------------------------
*/

in. main()
{
	bo.. a _ true;		// 1
	bo.. b _ false;		// 0

	bo.. result _ a || b;

	c__ __  bo..alpha __  result __  e..

	r_ 0;
}