//? *s..
//? |i..
//
//u.. s..
//
//in. main
//
//    setlocale(LC_ALL, "en_US.UTF-8");
//
//    in.     quantity    _ 8  // количесво единиц товара
//    in.     price       _ 75   // цена за единицу товара
//    d..  discount    _ 0.75 // скидка на общую стоимость 25%
//    in.     cost              // общая стоимость товара
//
//    //ЕСЛИ: количество тавара 10, или больше. ТО: получить скидку 25%. ИНАЧЕ: скидку не давать.
//
//    c.. _ (q.. >_ 10) | q.. * p.. * d.. | q.. * p..
//
//    c__ __  "Total cost of goods: " __  c.. __  e..
//
//
//    c__.g..
//    r_ _
//}
//
